#brew init should be called first
vorndranj/zsh-plugins path:brew

#custom plugins for aliases or init scripts
vorndranj/zsh-plugins path:bat
vorndranj/zsh-plugins path:docker
vorndranj/zsh-plugins path:eza
vorndranj/zsh-plugins path:fzf
vorndranj/zsh-plugins path:gcloud
vorndranj/zsh-plugins path:sdkman
vorndranj/zsh-plugins path:starship
vorndranj/zsh-plugins path:terraform
vorndranj/zsh-plugins path:thefuck
vorndranj/zsh-plugins path:volta
vorndranj/zsh-plugins path:yazi
vorndranj/zsh-plugins path:zoxide

#fish like features
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting

#alias suggestions
MichaelAquilina/zsh-you-should-use
